#ifndef _PARAMS_H_
#define _PARAMS_H_

#define BUSY_STR_ADR		0
#define CMD_CANC_ADR		1
#define EXPR_STR_ADDR		4

#define NUM_ICONS		3
#define CODE_ICO		0x00
#define CONN_ICO		0x01
#define BT_ICO			0x02

#ifdef CREATE_STRUCTS

#define GR_OFFSET			0
#define GR_INIT(GR, D)		GetAdr(GR) + GR_OFFSET + D, sizeof(T##GR##) - D

const struct MENU_GROUP groups[] = {
	"   1 цпсоою A   ", "    хмдхйюжхъ   ", GR_INIT(GroupA, 0),
	"   2 цпсоою B   ", "онкэг мюярпнийх ", GR_INIT(GroupB, 0),
	"   3 цпсоою C   ", "гюбнд мюярпнийх ", GR_INIT(GroupC, 0),
	"   4 цпсоою D   ", "    йнлюмдш     ", GR_INIT(GroupD, 0),
	"   6 цпсоою E   ", "     фспмюк     ", GR_INIT(GroupE, 2)
};

const struct MENU_PARAM params[] = { 		
"р0.реумнк. пец. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //0
"р1.пец. детейр. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //1
"р2.онкнфемхе    ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //2
"р3.йнлюмдю      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //3
"р4.явервхй жхйк.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //4
"р5.явервхй детей", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //5
"р6.рнй тюгш ю   ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //6
"р7.гюдюмхе онкнф", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //7
"р8.гюдюмхе яйнп.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //8
"р9.лнлемр рпнц. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //9
"р10.лнлемр сокнр", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //10
"р11.лнлемр дбхф.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //11
"р12.б35         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //12
"р13.б36         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //13
"р14.бпелъ рпнц. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //14
"р15.бпелъ сокнр.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //15
"р16.бпелъ дбхфем", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //16
"р17.лнлемр %    ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //17
"р18.яйнпнярэ    ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //18
"р19.б24         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //19
"р20.лнлемр ймЛ  ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //20
"р21.реяр дхяй бу", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //21
"р22.рейсы.детейр", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //22
"р23.пегепб      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //23
"р24.пегепб      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //24
"р25.пегепб      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //25
"р26.юдпея б яерх", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //26
"р27.б61         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //27
"р28.лнлемр      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //28
"р29.бепяхъ      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //29
"р30.лнлемр      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //30
"р31.бепяхъ      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //31
"р32.ондбепяхъ   ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //32
"р33.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //33
"р34.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //34
"р35.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //35
"р36.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //36
"р37.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //37
"р38.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //38
"р39.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), //39
//-------------------------------------------------------------------------
"B0.лнлемр гюйп  ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),
"B1.лнлемр нрйп  ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),
"B2.лнл сок гюйп ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),
"B3.лнл рпнц гюйп", "м*л ", 	0,     11,  	4, M_EDIT|M_KMM|M_RMAX(4),
"B4.лнл сок нрйп ", "м*л ", 	0,     11,  	2, M_EDIT|M_KMM|M_RMAX(4),
"B5.лнл рпнц нрйп", "м*л ", 	0,     11,  	4, M_EDIT|M_KMM|M_RMAX(4),
"B6.рхо гюдбхфйх ", "    ", 	0,      1,  	0, M_LIST|M_SADR(124),
"B7.рхо сокнрмем ", "    ", 	1,      4,  	1, M_LIST|M_SADR(126),
"B8.рхо ьрнйю    ", "    ", 	0,      1,  	0, M_LIST|M_SADR(131),
"B9.гнмю гюйпшрн ", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),
"B10.гнмю нрйпшрн", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),
"B11.гнмю ялеыем ", "на  ", 	0,    100,  	0, M_EDIT|M_RMAX(2)|M_PREC(1),
"B12.йнд днярсою ", "    ", 	0,  65530,  	0, M_CODE,
"   B13.бпелъ    ", "    ", 	0,  65530,  	0, M_TIME|M_PWP1,
"   B14.дюрю     ", "    ", 	0,  65530,  	0, M_DATE|M_PWP1,
"B15.йнпп вюянб  ", "я   ", -300U,    300,  	0, M_EDIT|M_SIGN|M_RMAX(2),
"B16.хмдхйюж рнйю", "    ", 	0,      1,  	0, M_LIST|M_SADR(133),
"B17.пефхл лс/дс ", "    ", 	0,      3,  	1, M_LIST|M_SADR(135),
#if BUR_M
"B18.пегепб      ", "    ", 	2,      2,  	2, M_SHOW|M_RMAX(4),
#else
"B18.хярнв йнл дс", "    ", 	0,      2,  	0, M_LIST|M_SADR(139),
#endif	
"B19.акнй гюкхо  ", "    ", 	0,      1,  	0, M_LIST|M_SADR(142),
"B20.бпелъ йнлюмд", "я   ", 	1,    100,  	1, M_EDIT|M_RMAX(2)|M_PREC(1),
#if BUR_M
"B21.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 
"B22.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 
#else
"B21.рхо бу яхцм ", "    ", 	0,      1,  	0, M_LIST|M_SADR(144),
"B22.люяй бу яхцм", "    ", 	0,     31,  	0, M_BINE|M_RMAX(4),
#endif				
"B23.люяй бшу яхц", "    ", 	0,  65530,  	0, M_BINE|M_RMAX(7),
"B24.яйнп ябъгх  ", "    ", 	0,      6,  	3, M_LIST|M_SADR(146),
"B25.юдпея ярюмж ", "    ", 	1,     32,  	1, M_EDIT|M_RMAX(1),
"B26.пефхл ябъгх ", "    ", 	0,      2,  	0, M_LIST|M_SADR(226),
"B27.пефхл онфюп ", "    ", 	0,      1,  	0, M_LIST|M_SADR(188),
"   B28.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B29.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B30.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B31.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"B32.бп нря дбхф ", "я   ", 	3,    100,     10, M_EDIT|M_RMAX(2)|M_PREC(1),
"B33.осрэ сокнрм ", "на  ", 	1,   1000,    100, M_EDIT|M_RMAX(3)|M_PREC(1),
"   B34.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"B35.дефспм пефхл", "C   ",     0,   6000,      0, M_HIDE|M_RMAX(3),
"   B36.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B37.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B38.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B39.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B40.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B41.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B42.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B43.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B44.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B45.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B46.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B47.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B48.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"   B49.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
//------------------------------------------------------------------
" я0.йнд днярсою ", "    ",     0,  65530,      0, M_CODE,
"я1.рхо опхбндю  ", "    ",     0,     10,      0, M_FLST|M_SADR(229),
"я2.цнд хгцнрнбк ", "    ",     0,     99,     14, M_FACT|M_RMAX(1),
"я3.гюбнд мнлеп  ", "    ",     0,   9999,      0, M_FACT|M_RMAX(3),
"я4.люйя лнлемр  ", "йм*л",    10,   1000,     10, M_FACT|M_RMAX(3)|M_PREC(2),
"я5.мнлхмюкэм рнй", "A   ",     1,    300,     10, M_FACT|M_RMAX(2)|M_PREC(1),
"я6.йо педсйрнпю ", "    ",     1,  65530,  20000, M_FACT|M_RMAX(4)|M_PREC(2),
"я7.йо акнй-пед  ", "    ",     1,  65530,    217, M_FACT|M_RMAX(4),
"я8.рнвм онкнфем ", "    ",     0,     16,      0, M_FACT|M_RMAX(1),
"я9.пюяяр веп тюг", "    ",     0,     75,     10, M_FACT|M_RMAX(1),
"я10.пюяяр лстрш ", "    ",     0,    100,      2, M_FACT|M_RMAX(2),
"C11.рхо дюрв онк", "    ",     0,     16,      0, M_FACT|M_RMAX(1),
"я12.хмдхй йюкхап", "    ",     0,      2,      2, M_FLST|M_SADR(153),
"C13.бп яап хмдхй", "C   ",     0,     30,     30, M_FACT|M_RMAX(1),
"я14.сцк соп яхтс", "цпюд",     0,    180,      0, M_SHOW|M_RMAX(2),
"я15.сцк мюцпсгйх", "цпюд", -180U,    180,      0, M_SHOW|M_SIGN|M_RMAX(2),
"я16.яберндхндш  ", "    ",     0,     255,     0, M_BINF|M_RMAX(8),
"я17.дюрв унккю  ", "    ",     0,     15,      0, M_BINF|M_RMAX(3),
"C18.он слнквюмхч", "    ",     0,      1,      0, M_FCOMM|M_SADR(157),
#if BUR_M
"я19.веп тюг яерх", "    ", 	0,      3,  	3, M_FLST|M_SADR(153),
#else
"   я19.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
#endif
"C20.оепецп дбхц ", "    ", 	0,      3,  	3, M_FLST|M_SADR(153),
"C21.с люйя U 47%", "B   ",    220,    600,    318, M_HIDE|M_RMAX(2),
"C22.T люйя U 47%", "C   ",      1,    200,     20, M_HIDE|M_RMAX(2)|M_PREC(1),
"я23.йнк.яанеб до", "    ",     0,     50,      0, M_SHOW|M_RMAX(1),
"я24.спнб яанъ до", "    ",     0,     50,      5, M_FACT|M_RMAX(1),
"я25.хмремя пюгц ", "    ",     0,    100,     10, M_FACT|M_RMAX(2),
"я26.сцнк рнплнф ", "цпюд",    60,    140,     110, M_FACT|M_RMAX(2),
"я27.бпелъ рнплнф", "C   ",     0,     50,      1, M_FACT|M_RMAX(1)|M_PREC(1),
"я28.йнк-бн сдюп ", "    ",     0,     10,      0, M_FACT|M_RMAX(1),
"я29.спнб люйя U ", "B   ",    220,    335,    275, M_FACT|M_RMAX(2),
"я30.бпел люйя U ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1),
"я31.спнб лхм U  ", "B   ",     90,    220,    125, M_FACT|M_RMAX(2),
"я32.бпел лхм U  ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1),
"я33.спнб меа U  ", "%   ",      3,     25,     10, M_FACT|M_RMAX(1),
"я34.бпел меа U  ", "C   ",      2,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),
"я35.спнб слем U ", "б   ",      0,    110,     70, M_FACT|M_RMAX(2),
"я36.бпел слем U ", "C   ",      1,    250,     10, M_FACT|M_RMAX(2)|M_PREC(1),
"C37.гюы слем I  ", "    ",      0,      3,      2, M_FLST|M_SADR(153),
"C38.спнб слем I ", "%   ",     20,    500,    100, M_FACT|M_RMAX(2)|M_PREC(1),
"C39.бпел слем I ", "C   ",      1,    100,     10, M_FACT|M_RMAX(1)|M_PREC(1),
"C40.бп-рнй гюы  ", "    ",      0,      3,      3, M_FLST|M_SADR(153),
"C41.спнб лхм I  ", "%   ",   1050,   1400,   1200, M_FACT|M_RMAX(3)|M_PREC(1),
"C42.спнб япед I ", "%   ",   1500,   1900,   1700, M_FACT|M_RMAX(3)|M_PREC(1),
"C43.спнб люйя I ", "%   ",   2000,   2250,   2100, M_FACT|M_RMAX(3)|M_PREC(1),
"C44.бпел лхм I  ", "C   ",      1,   6000,   1800, M_FACT|M_RMAX(3)|M_PREC(1),
"C45.бпел япед I ", "C   ",      1,   6000,   1200, M_FACT|M_RMAX(3)|M_PREC(1),
"C46.бпел люйя I ", "C   ",      1,   6000,    600, M_FACT|M_RMAX(3)|M_PREC(1),
"я47.бп веп тюг  ", "я   ",      1,    600,      8, M_EDIT|M_RMAX(2)|M_PREC(1),
"C48.сп оепец дб.", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),
"C49.бу оепец дб.", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"C50.гюы люйя U  ", "    ", 	 0,      3,  	 3, M_LIST|M_SADR(153),
"C51.гюы лхм U   ", "    ", 	 0,      3,  	 3, M_LIST|M_SADR(153),
"C52.гюы меаюк U ", "    ", 	 0,      3,  	 2, M_LIST|M_SADR(153),
"C53.гюы слем U  ", "    ", 	 0,      3,  	 3, M_LIST|M_SADR(153), 
"C54.веп тюг дбхц", "    ", 	 0,      3,  	 3, M_LIST|M_SADR(153),
"я55.бп люйя U м ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),
"я56.бп лхм U м  ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),
"C57.ондбепяхъ он", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"C58.гюы лхм I   ", "    ",      0,      3,      0, M_FLST|M_SADR(153),
"C59.сп лхм I    ", "%   ",     20,    500,    300, M_FACT|M_RMAX(2)|M_PREC(1),
"C60.бпел лхм I  ", "C   ",      1,    600,    300, M_FACT|M_RMAX(2)|M_PREC(1),
"C61.гюы меа I   ", "    ",      0,      3,      0, M_FLST|M_SADR(153),
"C62.сп меа I    ", "%   ",      2,     70,     65, M_FACT|M_RMAX(1),
"C63.бпел меа I  ", "C   ",      2,   1000,     10, M_FACT|M_RMAX(3)|M_PREC(1),
"C64.гюыхрю нр йг", "    ",      0,      3,      3, M_FLST|M_SADR(153),
"C65.бшанп д.рнпл", "    ", 	 0,      1,      0, M_LIST|M_SADR(242),
"я66.рхо хмдхйюр ", "    ",      0,      1,      0, M_FLST|M_SADR(240),
"C67.нрйк RTC    ", "    ",      0,  	 1,      1, M_FACT|M_RMAX(4),
"C68.хмд юбю сярп", "    ",      0,      2,      2, M_FLST|M_SADR(153),
"C69.оепец/оепену", "    ",      0,      3,      2, M_FLST|M_SADR(153),
" я70.сп оепецп  ", "цпюд",      0,    100,     90, M_FACT|M_SIGN|M_RMAX(2),
"я71.сп оепенук  ", "цпюд",   -50U,      0,   -37U, M_FACT|M_SIGN|M_RMAX(2),
"я72.сп бйк ремю ", "цпюд",   -40U,     10,   -10U, M_FACT|M_SIGN|M_RMAX(2),
"я73.сп бшйк рем ", "цпюд",   -20U,     50,     10, M_FACT|M_SIGN|M_RMAX(2),
"я74.йнпп релоеп ", "цпюд",  -100U,    100,      0, M_FACT|M_SIGN|M_RMAX(2),
"я75.мехяо лс/дс ", "    ",     0,       2,      2, M_FLST|M_SADR(153),  
"я76.рейсы ялеы U", "    ",-32000U,  32000,      0, M_SHOW|M_SIGN|M_RMAX(4),
"я77.рейсы ялеы V", "    ",-32000U,  32000,      0, M_FACT|M_SIGN|M_RMAX(4),
"я78.рейсы ялеы W", "    ",-32000U,  32000,      0, M_SHOW|M_SIGN|M_RMAX(4),
" я79.йнп рнйю U ", "    ",      0,  65530,   3800, M_FACT|M_RMAX(4),
" я80.йнп рнйю V ", "    ",      0,  65530,   3800, M_FACT|M_RMAX(4),
" я81.йнп рнйю W ", "    ",      0,  65530,   3800, M_FACT|M_RMAX(4),
"я82.ялеы рнйю U ", "    ",      0,  65530,  33000, M_FACT|M_RMAX(4),
"я83.ялеы рнйю V ", "    ",      0,  65530,  33000, M_FACT|M_RMAX(4),
"я84.ялеы рнйю W ", "    ",      0,  65530,  33000, M_FACT|M_RMAX(4),
" я85.йнп мюоп R ", "    ",      0,  65530,    160, M_FACT|M_RMAX(4),
" я86.йнп мюоп S ", "    ",      0,  65530,    160, M_FACT|M_RMAX(4),
" я87.йнп мюоп T ", "    ",      0,  65530,    160, M_FACT|M_RMAX(4),
"я88.ялеы мюоп R ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),
"я89.ялеы мюоп S ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),
"я90.ялеы мюоп T ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),
"я91.й ткрп мюоп ", "MйC ",      0,  65530,   5000, M_FACT|M_RMAX(4)|M_PREC(2),
"я92.й ткрп рнйю ", "MйC ",      0,  65530,   5000, M_FACT|M_RMAX(4)|M_PREC(2),
"я93.йнппейр жюо ", "    ",      0,  65530,   4100, M_FACT|M_RMAX(4),
"я94.ялеы жюо    ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),
"я95.онкнф гюйп  ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),
"я96.онкнф нрйп  ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),
"я97.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),
"я98.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),
"я99.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),
"я100.бепу сп йг ", "    ",      0,  65530,  45000, M_FACT|M_RMAX(4),	
"я101.мхфм сп йг ", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),
"я102.онкнфем    ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),
"C103.онмхф U    ", "    ",      0,  65530,   5050, M_FACT|M_RMAX(4),
"я104.йнщт 25%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),
"я105.йнщт 35%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),
"я106.йнщт 50%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),
"я107.йнщт 75%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),
"я108.йнщт 100%  ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),
"я109.йнп дн 40% ", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1),
"я110.йнп дн 60% ", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1), 
"я111.йнп дн 80% ", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1),
"я112.йнп дн 110%", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1),
"   я113.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   я114.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   я115.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   я116.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   я117.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   я118.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
//------------------------------------------------------------------
"D0.гюдюмхе гюйп ", "    ",      0,      2,      0, M_COMM|M_SADR(157),
"D1.гюдюмхе нрйп ", "    ",      0,      2,      0, M_COMM|M_SADR(157),
"D2.нанп мю нрйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),
"D3.нанп мю гюйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),
"  D4.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"D5.яапня йюкхап ", "    ",      0,      1,      0, M_COMM|M_SADR(160),
"D6.йнлюмд сопюбк", "    ",      0,     19,      0, M_COMM|M_SADR(162),
" D7.яапня гюыхр ", "    ",      0,      1,      0, M_COMM|M_SADR(160),
" D8.он слнквюмхч", "    ",      0,      1,      0, M_COMM|M_SADR(157),
"   D9.пегепб    ", "    ",      0,  65535,  	0, M_SHOW|M_SADR(4),
"D10.яапня жхйкнб", "    ",      0,      1,     0, M_COMM|M_SADR(160),
"D11.яапня ябъгх ", "    ", 	 0,  	 1,  	0, M_COMM|M_SADR(160),
"   D12.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
"   D13.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
"   D14.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
"   D15.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
"   D16.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
"   D17.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
"   D18.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
"   D19.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),
//-------------------------------------------------------------------
"G0.пефхл реярю  ", "    ",      0,      1,      0, M_FACT|M_RMAX(1),
"G1.реяр ябернд  ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),
"G2.реяр дхя бшу ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),
"G3.гмювемхе жюо ", "%   ",      0,   1000,      0, M_FDCOM|M_RMAX(3)|M_PREC(1),
"G4.ярюпр дхяок  ", "    ",      0,      1,      0, M_FDCOM,
"G5.TECT я йюлепш", "    ",      0,  65535,      0, M_BINFC|M_RMAX(4),
"G6.цпсо рхпхяр  ", "    ",      0,      1,      0, M_FDCOM,
"G7.пюгпеь яхтс  ", "    ",      0,      1,      0, M_FDCOM, 
"   G8.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G9.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G10.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G11.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G12.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G13.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G14.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G15.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G16.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G17.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"G18.реяр сцнк нр", "    ",      0,    200,      0, M_FDCOM|M_RMAX(2),
"   G19.пегепб   ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),
"   G20.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G21.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G22.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G23.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G24.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G25.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G26.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G27.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G28.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),
"   G29.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4), 
//-------------------------------------------------------------------
"янярнъмхе йюкхап", "    ",      0,      3,      0, M_HIDE,
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"онкнф гюйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),
"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),
"онкнф нрйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),
"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),
"    оюпнкэ 1    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"    оюпнкэ 2    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"   юбюпхх йг    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"   рнкэйн сонп  ", "    ", 	 0,      1,  	 0, M_HIDE|M_RMAX(1),
"м10.явервхй жхйк", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),
"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),
"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),
"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),
"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),
"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),
"  рнй оепеундю  ", "%   ",      0,   3000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),
" лнлемр рнй 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" лнлемр рнй 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"лнлемр сцнк 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" сцнк яхтс 0_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 0_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 0_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 0_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 0_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 1_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 1_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 1_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 1_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 1_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 2_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 2_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 2_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 2_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 2_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 3_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 3_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 3_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 3_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
" сцнк яхтс 3_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),
"бп бша гюгнпю   ", "C   ",      0,    100,      0, M_HIDE|M_RMAX(2)|M_PREC(1),
"дхюцмняр яерх   ", "    ",      0,  65530,      0, M_HIDE|M_SADR(35),
"мюопъф тюгш R   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),
"мюопъф тюгш S   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),
"мюопъф тюгш T   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),
"япедмее мюоп    ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),
"меаюк тюг яерх  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),
"вепед тюг яерх  ", "    ",      0,      2,      0, M_HIDE|M_SADR(182),
"мехяопюбм яерх  ", "    ",      0,  65530,      0, M_HIDE|M_SADR(35),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"дхюцм мюцпсгйх  ", "    ",      0,  65530,      0, M_HIDE|M_SADR(52),
"  рнй тюгш U    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),
"  рнй тюгш V    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),
"  рнй тюгш W    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),
" япедмхи рнй    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),
"меаюк рнй мюцп  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),
"  онкнфемхе     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" рхо пебепяю    ", "    ",      0,      2,      2, M_HIDE|M_SADR(185),
"делн онкнф 1    ", "%   ",      0,   1000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),
"делн онкнф 2    ", "%   ",      0,   1000,   1000, M_HIDE|M_RMAX(3)|M_PREC(1),
" яняр бунднб    ", "    ",      0,  65530,      0, M_HIDE|M_SADR(86),
" яняр бшунднб   ", "    ",      0,  65530,      0, M_HIDE|M_SADR(103),
"пекеимши пефхл  ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),
" бунд нрйпшрэ   ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бунд гюйпшрэ   ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бунд ярно      ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(190),
"дхюцм сярп-бю   ", "    ",      0,  65530,      0, M_HIDE|M_SADR(69),
"хмдхй б ярюпре  ", "    ",      0,     29,      18, M_HIDE|M_SADR(192),
"дефспмши пефхл  ", "C   ",      0,   6000,      0, M_HIDE|M_RMAX(3),
"опнжемр хяонкм  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),
"мюв юдп фспм яна", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"мюв юдп фспм йнл", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"мюв юдп фспм оюп", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"гюохях фспм яна ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"гюохях фспм йнл ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"гюохях фспм оюп ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"    лнлемр      ", "м*л ",      0,  11000,      0, M_HIDE|M_RMAX(4),
"    яйнпнярэ    ", "на/л", -3600U,   3600,      0, M_HIDE|M_SIGN|M_RMAX(3),
"    яейсмдш     ", "    ",      0,  	60,      0, M_HIDE|M_RMAX(1),
"соп йнмрюйрнпюлх", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"  йнлюмдш асп   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
" яапня фспмюкнб ", "    ",      0,  1,          0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
//-------------------------------------------------------------------
"ю0.ярюрся пюанрш", "    ",		0,	65530,		0, M_RUNS|M_SADR(1),
"ю1.дхюц опнжеяяю", "    ",		0,	65530,		0, M_RUNS|M_SADR(18),
"ю2.дхюцмняр яерх", "    ",		0,	65530,		0, M_RUNS|M_SADR(35),
"ю3.дхюц мюцпсгйх", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(52),
"ю4.дхюцм сярп-бю", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(69),
#if BUR_M
"ю5.пегепб       ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),
#else
" ю5.яняр бунднб ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(86),
#endif
" ю6.яняр бшунднб", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(103),
"  ю7.онкнфемхе  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 
"   ю8.лнлемр    ", "м*л ", 	0,  11000,  	0, M_SHOW|M_RMAX(4),
"   ю9.яйнпнярэ  ", "на/л",-3600U,   3600,  	0, M_SHOW|M_SIGN|M_RMAX(3),
"ю10.мюоп тюгш R ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),
"ю11.мюоп тюгш S ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),
"ю12.мюоп тюгш T ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),
" ю13.рнй тюгш U ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),
" ю14.рнй тюгш V ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),
" ю15.рнй тюгш W ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),
"ю16.сцнк мюцпсг ", "цпюд", -180U,    180,  	0, M_SHOW|M_SIGN|M_RMAX(2),
"ю17.ярюрся йюкха", "    ", 	0,      3,  	0, M_STAT|M_SADR(120),
"A18.онкнфемхе % ", "%   ",-1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),
" ю19.онкмши унд ", "на  ",     0,   3000,      0, M_SHOW|M_RMAX(3)|M_PREC(1),
"ю20.рейсыхи унд ", "на  ",-3000U,   3000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),
"ю21.явер жхйкнб ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),
"ю22.релоепюрспю ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),
"ю23.бепяхъ он   ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(3),
"ю24.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю25.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю26.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю27.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю28.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю29.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю30.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю31.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю32.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю33.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю34.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю35.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю36.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю37.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю38.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),
"ю39.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 
//------------------------------------------------------------------- 
"     бпелъ      ", "    ",      0,  65535,      0, M_TIME|M_RONLY,
"      дюрю      ", "    ",      0,  65535,     33, M_DATE|M_RONLY,
"E0.ярюрся пюанрш", "    ",      0,  65535,      0, M_RUNS|M_SADR(1),
"E1.дхюцм опнжеяя", "    ",      0,  65535,      0, M_RUNS|M_SADR(18),
"E2.дхюцмняр яерх", "    ",      0,  65535,      0, M_RUNS|M_SADR(35),
"E3.дхюцм мюцпсгй", "    ",      0,  65535,      0, M_RUNS|M_SADR(52),
"E4.дхюцм сярп-бю", "    ",      0,  65530,      0, M_RUNS|M_SADR(69),
"E5.онкнфемхе %  ", "%   ", -1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),
"    E6.лнлемр   ", "м*л ",     10,  11000,     10, M_SHOW|M_RMAX(4),
"E7.мюопъф тюгш R", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),
"E8.мюопъф тюгш S", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),
"E9.мюопъф тюгш T", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),
"E10.рнй тюгш U  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),
"E11.рнй тюгш V  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),
"E12.рнй тюгш W  ", "ю/% ",  	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),
"E13.релоеп акнй ", "цпюд",   -100U,    100,     0, M_SHOW|M_SIGN|M_RMAX(2),
"E14.яняр бунднб ", "    ",      0,  65535,      0, M_RUNS|M_SADR(86),
"E15.яняр бшунднб", "    ",      0,  65535,      0, M_RUNS|M_SADR(103),
"   E16.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E17.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E18.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E19.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E20.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E21.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E22.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E23.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E24.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E25.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E26.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E27.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E28.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),
"   E29.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4)
};


const struct MENU_STRING values[] = {  
	"    гюохяэ      ",	// 0
//----------------
	"  ме нопедекем  ",	// 1
	"      ярно      ",	// 2
	"     юбюпхъ     ",	// 3
	" хдер гюйпшрхе  ",	// 4
	" хдер нрйпшрхе  ",	// 5
	"   хдер реяр    ",	// 6
	"    гюйпшрн     ",	// 7
	"    нрйпшрн     ",	// 8
	"     лстрю      ",	// 9
	" леярмне сопюбк ",	// 10
	"  бйкчвем рем   ",	// 11
#if BUR_M
	"    охрюмхе     ",	// 12
#else
	" яепбхя охрюмхе ",	// 12
#endif
	"юбюпхъ мю акнйе ",	// 13
	"  юбюпхъ мю ря  ",	// 14
	"  мехяопюбмнярэ ",	// 15
	"мехяопюбм мю акй",	// 16
	"мехяопюбм мю ря ",	// 17 
//--------------------------
	"   мер юбюпхи   ",	// 18
	"  мер дбхфемхъ  ",	// 19
	"  веп тюг дбхц  ",	// 20
	" ме гюдюмн гюйп ",	// 21
	" ме гюдюмн нрйп ",	// 22
	" мер йюкхапнбйх ",	// 23
	"сокнрм ме днярхц",	// 24
	"  оепецпеб дбхц ",	// 25
	"  мехяоп лс/дс  ",	// 26
	"     пегепб     ",	// 27
	"     пегепб     ",	// 28
	"     пегепб     ",	// 29
	"     пегепб     ",	// 30
	"     пегепб     ",	// 31
	"     пегепб     ",	// 32
	"     пегепб     ",	// 33
	"     пегепб     ",	// 34
//--------------------------
	"   мер юбюпхи   ",	// 35
	"лхм мюоп тюгш R ",	// 36
	"лхм мюоп тюгш S ",	// 37
	"лхм мюоп тюгш T ",	// 38
	"люйя мюоп тюгш R",	// 39
	"люйя мюоп тюгш S",	// 40
	"люйя мюоп тюгш T",	// 41
	"меноп вепед тюг ",	// 42
	"меаюкюмя/напшб U",	// 43
	"слем мюоп тюгш R",	// 44
	"слем мюоп тюгш S",	// 45
	"слем мюоп тюгш T",	// 46
	"мюоп тюгш R 47% ",	// 47
	"мюоп тюгш S 47% ",	// 48
	"мюоп тюгш T 47% ",	// 49
	"  веп тюг яерх  ",	// 50
	"     пегепб     ",	// 51
//--------------------------
	"   мер юбюпхи   ",	// 52
	"  напшб тюгш U  ",	// 53
	"  напшб тюгш V  ",	// 54
	"  напшб тюгш W  ",	// 55
	"бп-рнй оепецпсгй",	// 56
	"     пегепб     ",	// 57
	"   йг тюгш U    ",	// 58
	"   йг тюгш V    ",	// 59
	"   йг тюгш W    ",	// 60
	"     пегепб     ",	// 61
	"     пегепб     ",	// 62
	" лхмхлюкэм рнй  ",	// 63
	" меаюкюмя рнйю  ",	// 64
	"     пегепб     ",	// 65
	"     пегепб     ",	// 66
	"     пегепб     ",	// 67
	"     пегепб     ",	// 68
	//---------------------------------------------------------------------------
	"   мер юбюпхи   ",	// 69
	"яани дюрв онкнф ",	// 70
	" яани оюлърх 1  ",	// 71
	" яани оюлърх 2  ",	// 72
	"   яани вюянб   ",	// 73
	"яани дюрв релоеп",	// 74
	" оепецпеб акнйю ",	// 75
	"оепенукюфд акнйю",	// 76
	"  яани ря/рс    ",	// 77
	#if BUR_M
	"     пегепб     ",	// 78
	#else
	"бшйкчвемхе акнйю",	// 78
	#endif
	"     пегепб     ",	// 79
	"     пегепб     ",	// 80
	"йпхр оепецпеб ак",	// 81
	"     пегепб     ",	// 82
	"     пегепб     ",	// 83
	"     пегепб     ",	// 84
	"     пегепб     ",	// 85
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 86
	"  бунд нрйпшрэ  ",	// 87
	"  бунд гюйпшрэ  ",	// 88
	"   бунд ярно    ",	// 89
	"    бунд лс     ",	// 90
	"    бунд дс     ",	// 91
	"     пегепб     ",	// 92
	"     пегепб     ",	// 93
	"     пегепб     ",	// 94
	"     пегепб     ",	// 95
	"     пегепб     ",	// 96
	"     пегепб     ",	// 97
	"     пегепб     ",	// 98
	"     пегепб     ",	// 99
	"     пегепб     ",	// 100
	"     пегепб     ",	// 101
	"     пегепб     ",	// 102
	//---------------------------------------------------------------------------
#if BUR_M
	"  мер яхцмюкнб  ",	// 103
	"    пегепб      ",	// 104
	"    пегепб      ",	// 105
	"     лстрю      ",	// 106
	"     юбюпхъ     ",	// 107
	"    пегепб      ",	// 108
	"     охрюмхе    ",	// 109
	"     гюйпшрн    ",	// 110
	"     нрйпшрн    ",	// 111
	" мехяопюбмнярэ  ",	// 112
	"     пегепб     ",	// 113
	"     пегепб     ",	// 114
	"     пегепб     ",	// 115
	"     пегепб     ",	// 116
	"     пегепб     ",	// 117
	"     пегепб     ",	// 118
	"     пегепб     ",	// 119
#else
	"  мер яхцмюкнб  ",	// 103
	"    юбюпхъ      ",	// 104
	"    гюйпшрн     ",	// 105
	"    нрйпшрн     ",	// 106
	"     лстрю      ",	// 107
	"  гюйпшбюеряъ   ",	// 108
	"  нрйпшбюеряъ   ",	// 109
	"     лс/дс      ",	// 110
	"  мехяопюбмнярэ ",	// 111
	"     пегепб     ",	// 112
	"     пегепб     ",	// 113
	"     пегепб     ",	// 114
	"     пегепб     ",	// 115
	"     пегепб     ",	// 116
	"     пегепб     ",	// 117
	"     пегепб     ",	// 118
	"     пегепб     ",	// 119
#endif
	//---------------------------------------------------------------------------
	" мер йюкхапнбйх ",	// 120
	" гюдюмн гюйпшрн ",	// 121
	" гюдюмн нрйпшрн ",	// 122
	"йюкхап бшонкмемю",	// 123
	//---------------------------------------------------------------------------
	"    йкхмнбюъ    ",	// 124
	"    ьхаепмюъ    ",	// 125
	//---------------------------------------------------------------------------
	"  ме нопедекем  ",	// 126
	" аег сокнрмемхъ ",	// 127
	"сокнрмемхе гюйп ",	// 128
	"сокнрмемхе нрйп ",	// 129
	"сок гюйп х нрйп ",	// 130
	//---------------------------------------------------------------------------
	"   мнплюкэмши   ",	// 131
	"    напюрмши    ",	// 132
	//---------------------------------------------------------------------------
	"деиярб гмювемхъ ",	// 133
	"опнжемрш нр мнл ",	// 134
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 135
	"  бшанп пефхлю  ",	// 136
	"    пефхл лс    ",	// 137
	"    пефхл дс    ",	// 138
	//---------------------------------------------------------------------------
	" бяе хмрептеияш ",	// 139
	"рнкэйн дхяйперм ",	// 140
	"рнкэйн онякеднб ",	// 141
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 142
	"    бйкчвемю    ",	// 143
	//---------------------------------------------------------------------------
	"      24б       ",	// 144
	"      220б      ",	// 145
	//---------------------------------------------------------------------------
	"    2400 анд    ",	// 146
	"    4800 анд    ",	// 147
	"    9600 анд    ",	// 147
	"   19200 анд    ",	// 149
	"   38400 анд    ",	// 150
	"   57600 анд    ",	// 151
	"   115200 анд   ",	// 152
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 153
	" хмдхй мю акнйе ",	// 154
	"хмд мю акнйе/ря ",	// 155
	"хмдхй х нярюмнб ",	// 156
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 157
	"     гюдюрэ     ",	// 158
	"    яапняхрэ    ",	// 159
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 160
	"    яапняхрэ    ",	// 161
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 162
	"      ярно      ",	// 163
	"    гюйпшрэ     ",	// 164
	"    нрйпшрэ     ",	// 165
	"  гюйпшрэ реяр  ",	// 166
	"  нрйпшрэ реяр  ",	// 167
	"     пегепб     ",	// 168
	"     пегепб     ",	// 169
	"     пегепб     ",	// 170
	"     пегепб     ",	// 171
	"     пегепб     ",	// 172
	"     пегепб     ",	// 173
	"     пегепб     ",	// 174
	"     пегепб     ",	// 175
	"     пегепб     ",	// 176
	"     пегепб     ",	// 177
	"     пегепб     ",	// 178
	"     пегепб     ",	// 179
	"     пегепб     ",	// 180
	"     пегепб     ",	// 181
	//---------------------------------------------------------------------------
	" ме нопедекемн  ",	// 182
	"напюрм онякеднб ",	// 183
	"опълюъ онякеднб ",	// 184
	//---------------------------------------------------------------------------
	"    нярюмнб     ",	// 185
	" юбрнлюрхвеяйхи ",	// 186
	"  хцмнпхпнбюмхе ", // 187
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 188
	"    бйкчвем     ",	// 189
	//---------------------------------------------------------------------------
	"мнпл пюгнлймсрши",	// 190
	" мнпл гюлймсрши ",	// 191
	//---------------------------------------------------------------------------
	" ярюрся пюанрш  ",	// 192
	" дхюцм опнжеяяю ",	// 193
	" дхюцмняр яерх  ",	// 194
	" дхюцм мюцпсгйх ",	// 195
	" дхюцм сярп-бю  ",	// 196
	"  яняр бунднб   ",	// 197
	"  яняр бшунднб  ",	// 198
	"     пегепб     ",	// 199
	"     лнлемр     ",	// 200
	"    яйнпнярэ    ",	// 201
	"  япедмее мюоп  ",	// 202
	"  япедмхи рнй   ",	// 203
	" сцнк мюцпсгйх  ",	// 204
	"     пегепб     ",	// 205
	"     пегепб     ",	// 206
	"     пегепб     ",	// 207
	"     пегепб     ",	// 208
	"     пегепб     ",	// 209
	"     пегепб     ",	// 210
	"     пегепб     ",	// 211
	"     пегепб     ",	// 212
	"     пегепб     ",	// 213
	"     пегепб     ",	// 214
	"     пегепб     ",	// 215
	"     пегепб     ",	// 216
	"     пегепб     ",	// 217
	"     пегепб     ",	// 218
	"     пегепб     ",	// 219
	"     пегепб     ",	// 220	
	"     пегепб     ",	// 221
	//----------------------------------------------
	"  он сярюбйюл   ",	// 222
	"он сяр я гюдепфй",	// 223
	" бяецдю бйк     ",	// 224
	" псвмне соп     ",	// 225
	//-----------------------------------------------
	"  аег опнбепйх  ",	// 226
	" мю мевермнярэ  ",	// 227
	"  мю вермнярэ   ",	// 228
   //-----------------------------------------------
    "ме нопедекем    ",	// 229
	"щож-100 ю.25    ",	// 230
	"щож-100 ю.50    ",	// 231
	"щож-400 а.20    ",	// 232
	"щож-400 а.50    ",	// 233
	"щож-800 б.40    ",	// 234
	"щож-1000 б.20   ",	// 235
	"щож-4000 ц.9    ",	// 236
	"щож-4000 ц.18   ",	// 237
	"щож-10000 д.6   ",	// 238
	"щож-10000 д.12  ",	// 239
  //---------------------------------------------------
	"  OLED WINSTAR  ",	// 240
	"   VAC FUTABA   ",	// 241
	//---------------------------------------------------------------------------
	"рнплнфем. ярюпне",	// 242
	"рнплнфемхе мнбне"	// 243 

};

const struct MENU_STRING AddStr[] = {
	"сярпниярб гюмърн",	// 0
	"    йнлюмдю     ",	// 1
	"    нрлемемю    ",	// 2
	"  о 999.99%     ",	// 3
	//-----------------------------------------------
	"щйяо. мюярпнийю?",	// 4	0
	"    дю  мер     ",	// 5
	" гюдюрэ лнлемр  ",	// 6	1
	"йюкхапнбйх  нй  ",	// 7
	" рхо йюкхапнбйх ",	// 8	2
	" псвм  йнк.нанп ",	// 9	
	"оепебедх б онкнф",	// 10	3
	" гюйпшрн   нй   ",	// 11
	"оепебедх б онкнф",	// 12	4
	" нрйпшрн   нй   ",	// 13	
	"оепебедх б йпюим",	// 14	5
	"онкнфемхе   нй  ",	// 15
	"   онкнфемхе    ",	// 16	6
	"   гюйп  нрйп   ",	// 17
	"опнбепхрэ йюкха?",	// 18	7
	"    дю  мер     ", // 19
	"   осярхре б    ",	// 20	8
	"    нрйпшрн     ", // 21
	"   онкнфемхе    ",	// 22	9	// гДЕЯЭ БШБНДЪРЯЪ РЕЙСЫХЕ НАНПНРШ
	"                ", // 23
	"яапня йюкхапнб? ",	// 24	10
	"    дю  мер     ", // 25
	"   осярхре б    ",	// 26	11
	"    гюйпшрн     ", // 27
	" сярпюхб йюкха? ",	// 28	12
	"    дю  мер     ", // 29
	"гюдюире пюанвхе ",	// 30	13
	"  лнлемрш   нй  ", // 31
};


// ТХЙЯХПНБЮММШЕ РНВЙХ ДКЪ ЯМЪРХЪ ЛНЛЕМРЮ
Int VoltArray[CUB_COUNT1] = {160, 190,  220,  250};
Int CurrArray[CUB_COUNT2] = {400, 800, 1200, 1600, 2000};
Int AnUIArray[CUB_COUNT2] = { 25,  35,   50,   65,   80};
Int TorqArray[CUB_COUNT2] = { 25,  30,   50,   75,  100};

#if !TORQ_TEST
TCubConfig TqCurr  = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Imidpr, CurrArray};
TCubConfig TqAngUI = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Ram.GroupC.AngleUI, AnUIArray};
TCubConfig TqAngSf = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Dmc.TorqueSetPr, TorqArray};
#else
TCubConfig TqCurr  = {(Int *)&TqUmid, VoltArray, (Int *)&TqImidPr,        CurrArray};
TCubConfig TqAngUI = {(Int *)&TqUmid, VoltArray, (Int *)&TqAnUI,          AnUIArray};
TCubConfig TqAngSf = {(Int *)&TqUmid, VoltArray, (Int *)&Dmc.TorqueSetPr, TorqArray};
#endif



char Icons[NUM_ICONS][7] =	{
				0x1F,0x11,0x1F,0x04,0x06,0x04,0x07,
				0x1F,0x11,0x11,0x1F,0x04,0x1F,0x00,
				0x06,0x15,0x0D,0x06,0x0D,0x015,0x06,
				};


#endif	//CREATE_STRUCTS


// лЮЙПНЯ ВРЕМХЪ ЯРПНЙХ ХГ ТКЕЬ. лЮЯЯХБ add_strings
#define ReadAddStr(Str, Index) \
	PFUNC_blkRead((int16*)&AddStr[Index], (int16*)Str, 16)

// лЮЙПНЯ ВРЕМХЪ ЯРПНЙХ ХГ ТКЕЬ. лЮЯЯХБ add_strings
#define ReadValuesStr(Str, Index) \
	PFUNC_blkRead((int16*)&values[Index], (int16*)Str, 16)

extern const struct MENU_GROUP  groups[];
extern const struct MENU_PARAM  params[];
extern const struct MENU_STRING values[];
extern const struct MENU_STRING AddStr[];
extern TCubConfig TqCurr;
extern TCubConfig TqAngUI;
extern TCubConfig TqAngSf;
extern char Icons[NUM_ICONS][7];

#endif
