#ifndef _PARAMS_H_
#define _PARAMS_H_

#define BUSY_STR_ADR		0
#define CMD_CANC_ADR		1
#define EXPR_STR_ADDR		4

#define NUM_ICONS		3
#define CODE_ICO		0x00
#define CONN_ICO		0x01
#define BT_ICO			0x02

#ifdef CREATE_STRUCTS

#define GR_OFFSET			0
#define GR_INIT(GR, D)		GetAdr(GR) + GR_OFFSET + D, sizeof(T##GR##) - D

const struct MENU_GROUP groups[] = {
	"   1 цпсоою A   ", "    хмдхйюжхъ   ", GR_INIT(GroupA, 0),
	"   2 цпсоою B   ", "онкэг мюярпнийх ", GR_INIT(GroupB, 0),
	"   3 цпсоою C   ", "гюбнд мюярпнийх ", GR_INIT(GroupC, 0),
	"   4 цпсоою D   ", "    йнлюмдш     ", GR_INIT(GroupD, 0),
	"   6 цпсоою E   ", "     фспмюк     ", GR_INIT(GroupE, 2)
};

const struct MENU_PARAM params[] = { 		
"р0.реумнк. пец. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//0
"р1.пец. детейр. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//1
"р2.онкнфемхе    ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//2
"р3.йнлюмдю      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//3
"р4.явервхй жхйк.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//4
"р5.явервхй детей", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//5
"р6.рнй тюгш ю   ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//6
"р7.гюдюмхе онкнф", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//7
"р8.гюдюмхе яйнп.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//8
"р9.лнлемр рпнц. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//9
"р10.лнлемр сокнр", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//10
"р11.лнлемр дбхф.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//11
"р12.б35         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//12
"р13.б36         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//13
"р14.бпелъ рпнц. ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//14
"р15.бпелъ сокнр.", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//15
"р16.бпелъ дбхфем", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//16
"р17.лнлемр %    ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//17
"р18.яйнпнярэ    ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//18
"р19.б24         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//19
"р20.лнлемр ймЛ  ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//20
"р21.реяр дхяй бу", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//21
"р22.рейсы.детейр", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//22
"р23.пегепб      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//23
"р24.пегепб      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//24
"р25.пегепб      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//25
"р26.юдпея б яерх", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//26
"р27.б61         ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//27
"р28.лнлемр      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//28
"р29.бепяхъ      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//29
"р30.лнлемр      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//30
"р31.бепяхъ      ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//31
"р32.ондбепяхъ   ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//32
"р33.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//33
"р34.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//34
"р35.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//35
"р36.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//36
"р37.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//37
"р38.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//38
"р39.            ", "    ",		0,	   65535,		0, M_EDIT|M_RMAX(4), 	//39
//-------------------------------------------------------------------------
"B0.лнлемр гюйп  ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),	//40
"B1.лнлемр нрйп  ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),	//41
"B2.лнл сок гюйп ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),	//42
"B3.лнл рпнц гюйп", "м*л ", 	0,     11,  	4, M_EDIT|M_KMM|M_RMAX(4),	//43
"B4.лнл сок нрйп ", "м*л ", 	0,     11,  	2, M_EDIT|M_KMM|M_RMAX(4),	//44
"B5.лнл рпнц нрйп", "м*л ", 	0,     11,  	4, M_EDIT|M_KMM|M_RMAX(4),	//45
"B6.рхо гюдбхфйх ", "    ", 	0,      1,  	0, M_LIST|M_SADR(124),		//46
"B7.рхо сокнрмем ", "    ", 	1,      4,  	1, M_LIST|M_SADR(126),		//47
"B8.рхо ьрнйю    ", "    ", 	0,      1,  	0, M_LIST|M_SADR(131),		//48
"B9.гнмю гюйпшрн ", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),//49
"B10.гнмю нрйпшрн", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),//50
"B11.гнмю ялеыем ", "на  ", 	0,    100,  	0, M_EDIT|M_RMAX(2)|M_PREC(1),//51
"B12.йнд днярсою ", "    ", 	0,  65530,  	0, M_CODE,					//52
"   B13.бпелъ    ", "    ", 	0,  65530,  	0, M_TIME|M_PWP1,			//53
"   B14.дюрю     ", "    ", 	0,  65530,  	0, M_DATE|M_PWP1,			//54
"B15.йнпп вюянб  ", "я   ", -300U,    300,  	0, M_EDIT|M_SIGN|M_RMAX(2),	//55
"B16.хмдхйюж рнйю", "    ", 	0,      1,  	0, M_LIST|M_SADR(133),		//56
"B17.пефхл лс/дс ", "    ", 	0,      3,  	1, M_LIST|M_SADR(135),		//57
#if BUR_M
"B18.пегепб      ", "    ", 	2,      2,  	2, M_SHOW|M_RMAX(4),		//58
#else
"B18.хярнв йнл дс", "    ", 	0,      2,  	0, M_LIST|M_SADR(139),		//58
#endif	
"B19.акнй гюкхо  ", "    ", 	0,      1,  	0, M_LIST|M_SADR(142),		//59
"B20.бпелъ йнлюмд", "я   ", 	1,    100,  	1, M_EDIT|M_RMAX(2)|M_PREC(1),//60
#if BUR_M
"B21.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 		//61
"B22.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 		//62
#else
"B21.рхо бу яхцм ", "    ", 	0,      1,  	0, M_LIST|M_SADR(144),		//61
"B22.люяй бу яхцм", "    ", 	0,     31,  	0, M_BINE|M_RMAX(4),		//62
#endif				
"B23.люяй бшу яхц", "    ", 	0,  65530,  	0, M_BINE|M_RMAX(7),		//63
"B24.яйнп ябъгх  ", "    ", 	0,      6,  	3, M_LIST|M_SADR(146),		//64
"B25.юдпея ярюмж ", "    ", 	1,     32,  	1, M_EDIT|M_RMAX(1),		//65
"B26.пефхл ябъгх ", "    ", 	0,      2,  	0, M_LIST|M_SADR(226),		//66
"B27.пефхл онфюп ", "    ", 	0,      1,  	0, M_LIST|M_SADR(188),		//67
"   B28.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//68
"   B29.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//69
"   B30.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//70
"   B31.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//71
"B32.бпел нцп лнл", "я   ", 	3,    100,     10, M_EDIT|M_RMAX(2)|M_PREC(1),//72		
"B33.осрэ сокнрм ", "на  ", 	1,   1000,    100, M_EDIT|M_RMAX(3)|M_PREC(1),//73
"   B34.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//74
"B35.дефспм пефхл", "C   ",     0,   6000,      0, M_HIDE|M_RMAX(3),		//75
"   B36.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//76
"   B37.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//77
"   B38.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//78
"   B39.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//79
"   B40.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//80
"   B41.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//81
"   B42.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//82
"   B43.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//83
"   B44.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//84
"   B45.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//85
"   B46.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//86
"   B47.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//87
"   B48.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//88
"   B49.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//89
//------------------------------------------------------------------
//-----------------------нАЫХЕ МЮЯРПНИЙХ
" я0.йнд днярсою ", "    ",     0,  65530,      0, M_CODE,					//90
"я1.рхо опхбндю  ", "    ",     0,     10,      0, M_FLST|M_SADR(229),		//91
"я2.цнд хгцнрнбк ", "    ",     0,     99,     15, M_FACT|M_RMAX(1),		//92
"я3.гюбнд мнлеп  ", "    ",     0,   9999,      0, M_FACT|M_RMAX(3),		//93
"я4.люйя лнлемр  ", "йм*л",    10,   1000,     10, M_FACT|M_RMAX(3)|M_PREC(2),//94	
"я5.мнлхмюкэм рнй", "A   ",     1,    300,     10, M_FACT|M_RMAX(2)|M_PREC(1),//95
"я6.йо педсйрнпю ", "    ",     1,  65530,  20000, M_FACT|M_RMAX(4)|M_PREC(2),//96
"C7.йнк.яанеб до ", "    ",     0,    100,      0, M_SHOW|M_RMAX(2),		//97
"C8.спнб яанъ до ", "%   ",     0,    100,     50, M_FACT|M_RMAX(2), 		//98
"я9.дюрв унккю   ", "    ",     0,     15,      0, M_BINF|M_RMAX(3),		//99
"C10.ондбепяхъ он", "    ",     0,  65535,      0, MT_VERS|M_RONLY|M_NVM|M_PREC(2)|M_RMAX(4),//	100
"я11.йо акнй-пед ", "    ",     1,  65530,    217, M_FACT|M_RMAX(4),		//101
"я12.жхйкш опнцнм", "    ",     0,     50,      0, MT_DEC|M_PWP2|M_RMAX(1),	//102					
//-----------------------бРНПНЯРЕОЕММШЕ МЮЯРПНИЙХ
"я13.пюяяр лстрш ", "    ",     0,    100,      2, M_FACT|M_RMAX(2),		//103
"C14.рхо дюрв онк", "    ",     0,     16,      0, M_FACT|M_RMAX(1), 		//104
"C15.бп яап хмдхй", "C   ",     0,     30,     30, M_FACT|M_RMAX(1),		//105
"C16.он слнквюмхч", "    ",     0,      1,      0, M_FCOMM|M_SADR(157),		//106
"я17.хмремя пюгц ", "    ",     0,    100,     10, M_FACT|M_RMAX(2),		//107
"   я18.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//108
//-----------------------рНПЛНФЕМХЕ
"я19.сцнк рнплнф ", "цпюд",    60,    150,    140, M_FACT|M_RMAX(2),		//109
"я20.бпелъ рнплнф", "C   ",     0,     50,      1, M_FACT|M_RMAX(1)|M_PREC(1),//110 
"   я21.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//111
"   я22.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//112
"   я23.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//113
"   я24.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//114
"   я25.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//115
"   я26.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//116
"   я27.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//117
"   я28.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//118
"   я29.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//119
"   я30.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//120
"   я31.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//121
"   я32.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//122
"   я33.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//123
"   я34.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//124
//----------------------мЮЯРПНИЙЮ ДЮРВХЙНБ
"я35.йнпп релоеп ", "цпюд", -100U,    100,      0, M_FACT|M_SIGN|M_RMAX(2),	//125
"   я36.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//126
"   я37.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//127
"я38.й ткрп мюоп ", "MйC ",     0,  65530,   5000, M_FACT|M_RMAX(4)|M_PREC(2),		//128
"я39.й ткрп рнйю ", "MйC ",     0,  65530,   5000, M_FACT|M_RMAX(4)|M_PREC(2), 		//129
"   я40.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//130
"   я41.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//131
"   я42.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//132
"   я43.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//133
"   я44.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//134
"   я45.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//135
"   я46.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//136
"   я47.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//137
"   я48.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//138
"   я49.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//139
"   я50.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//140
"   я51.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//141
"   я52.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//142
"   я53.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//143
//----------------------йНМТХЦСПЮЖХЪ ГЮЫХР
"C54.гюы люйя U  ", "    ", 	0,      3,      3, M_LIST|M_SADR(153),		//144
"C55.с люйя U 47%", "B   ",   220,    600,    318, M_HIDE|M_RMAX(2),		//145
"C56.T люйя U 47%", "C   ",     1,    200,     20, M_HIDE|M_RMAX(2)|M_PREC(1),		//146
"я57.спнб люйя U ", "B   ",    220,    335,    265, M_FACT|M_RMAX(2),		//147
"я58.бп люйя U м ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),		//148
"я59.бпел люйя U ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1), 	//149
"C60.гюы лхм U   ", "    ", 	 0,      3,  	 3, M_LIST|M_SADR(153),		//150
"я61.спнб лхм U  ", "B   ",     90,    220,    125, M_FACT|M_RMAX(2),		//151
"я62.бп лхм U м  ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),		//152
"я63.бпел лхм U  ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1),		//153
"C64.гюы меаюк U ", "    ", 	 0,      3,  	 2, M_LIST|M_SADR(153),		//154
"я65.спнб меа U  ", "%   ",      3,     25,     10, M_FACT|M_RMAX(1),		//155
"я66.бпел меа U  ", "C   ",      2,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),		//156 
"C67.гюы слем U  ", "    ", 	 0,      3,  	 3, M_LIST|M_SADR(153), 		//157
"я68.спнб слем U ", "б   ",      0,    110,     70, M_FACT|M_RMAX(2),		//158
"   я69.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//159
"я70.бпел слем U ", "C   ",      1,    250,     10, M_FACT|M_RMAX(2)|M_PREC(1),		//160
#if BUR_M
"я71.веп тюг яерх", "    ", 	0,      3,  	3, M_FLST|M_SADR(153),		//161
#else
"   я71.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//161
#endif 
"C72.гюы слем I  ", "    ",      0,      3,      2, M_FLST|M_SADR(153),		//162
"C73.спнб слем I ", "%   ",     20,    500,    100, M_FACT|M_RMAX(2)|M_PREC(1),		//163
"C74.бпел слем I ", "C   ",      1,    100,     10, M_FACT|M_RMAX(1)|M_PREC(1),		//164 
"C75.бп-рнй гюы  ", "    ",      0,      3,      3, M_FLST|M_SADR(153),		//165
"   я76.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//166
"   я77.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//167
"   я78.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//168
"   я79.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//169
"   я80.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//170
"   я81.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//171
"   я82.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//172
"   я83.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//173
"   я84.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//174
"C85.гюы меа I   ", "    ",      0,      3,      0, M_FLST|M_SADR(153),		//175
"C86.сп меа I    ", "%   ",      2,     70,     65, M_FACT|M_RMAX(1),		//176
"C87.бпел меа I  ", "C   ",      2,   1000,     10, M_FACT|M_RMAX(3)|M_PREC(1),		// 177
"C88.гюыхрю нр йг", "    ",      0,      3,      3, M_FLST|M_SADR(153),		//178
"я89.спнбемэ йг  ", "    ",      0,  32767,  12500, M_FACT|M_RMAX(4),		//179
"   я90.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//180
"я91.хмдхй йюкхап", "    ",      0,      2,      2, M_FLST|M_SADR(153),		//181
"C92.хмд юбю сярп", "    ",      0,      2,      2, M_FLST|M_SADR(153),		//182
"C93.оепец/оепену", "    ",      0,      3,      2, M_FLST|M_SADR(153),		//183
"   я94.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//184
" я95.сп оепецп  ", "цпюд",      0,    100,     90, M_FACT|M_SIGN|M_RMAX(2),//185
"я96.сп оепенук  ", "цпюд",   -50U,      0,   -37U, M_FACT|M_SIGN|M_RMAX(2),//186
"я97.сп бйк ремю ", "цпюд",   -40U,     10,   -10U, M_FACT|M_SIGN|M_RMAX(2),//187
"я98.сп бшйк рем ", "цпюд",   -20U,     50,     10, M_FACT|M_SIGN|M_RMAX(2),//188
"C99.оепецп дбхц ", "    ", 	0,      3,  	3, M_FLST|M_SADR(153),		//189
"C100.сп оепец дб", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),		//190
"C101.бу оепец дб", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4), 		//191
"   я102.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//192
"C103.веп тюг дб ", "    ", 	 0,      3,  	 3, M_LIST|M_SADR(153),		//193
"я104.бп веп тюг ", "я   ",      1,    600,      8, M_EDIT|M_RMAX(2)|M_PREC(1),		//194
"я105.мехяо лс/дс", "    ",      0,      2,      2, M_FLST|M_SADR(153),  	//195
"C106.нрйк RTC   ", "    ",      0,  	 1,      1, M_FACT|M_RMAX(4),		//196
"я107.яани дюрв о", "    ",      0,      1,      0, MT_STR|M_PWP2|M_NVM|M_SADR(244),//197
//--------------------мЮЯРПНИЙХ ЛНЛЕМРНБ
"   я108.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//198
"я109.йнщт 25%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),//199
"я110.йнщт 35%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),//200
"я111.йнщт 50%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),//201
"я112.йнщт 75%   ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),//202
"я113.йнщт 100%  ", "    ",   -15U,     15,      0, M_FACT|M_SIGN|M_RMAX(1),//203
"я114.йнп дн 40% ", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1),//204
"я115.йнп дн 60% ", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1),//205
"я116.йнп дн 80% ", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1),//206
"я117.йнп дн 110%", "    ",   -25U,     25,      0, M_FACT|M_SIGN|M_RMAX(1),//207
"   я118.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//208
"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//209
//------------------------------------------------------------------
"D0.гюдюмхе гюйп ", "    ",      0,      2,      0, M_COMM|M_SADR(157),		//210
"D1.гюдюмхе нрйп ", "    ",      0,      2,      0, M_COMM|M_SADR(157),		//211
"D2.нанп мю нрйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),		//212
"D3.нанп мю гюйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),		//213
"  D4.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//214
"D5.яапня йюкхап ", "    ",      0,      1,      0, M_COMM|M_SADR(160),		//215
"D6.йнлюмд сопюбк", "    ",      0,     19,      0, M_COMM|M_SADR(162),		//216
" D7.яапня гюыхр ", "    ",      0,      1,      0, M_COMM|M_SADR(160),		//217
" D8.он слнквюмхч", "    ",      0,      1,      0, M_COMM|M_SADR(157),		//218
"   D9.пегепб    ", "    ",      0,  65535,  	0, M_SHOW|M_SADR(4),		//219
"D10.яапня жхйкнб", "    ",      0,      1,     0, M_COMM|M_SADR(160),		//220
"D11.яапня ябъгх ", "    ", 	 0,  	 1,  	0, M_COMM|M_SADR(160),		//221
"   D12.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//222
"   D13.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//223
"   D14.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//224
"   D15.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//225
"   D16.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//226
"   D17.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//227
"   D18.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//228
"   D19.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),		//229
//-------------------------------------------------------------------
"G0.пефхл реярю  ", "    ",      0,      1,      0, M_FACT|M_RMAX(1),		//230
"G1.реяр ябернд  ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),		//231
"G2.реяр дхя бшу ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),		//232
"G3.гмювемхе жюо ", "%   ",      0,   1000,      0, M_FDCOM|M_RMAX(3)|M_PREC(1),		//233
"G4.ярюпр дхяок  ", "    ",      0,      1,      0, M_FDCOM,				//234
"G5.TECT я йюлепш", "    ",      0,  65535,      0, M_BINFC|M_RMAX(4),		//235
"G6.цпсо рхпхяр  ", "    ",      0,      1,      0, M_FDCOM,				//236
"G7.пюгпеь яхтс  ", "    ",      0,      1,      0, M_FDCOM, 				//237
"   G8.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//238
"   G9.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//239
"   G10.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//240
"   G11.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//241
"   G12.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//242
"   G13.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//243
"   G14.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//244
"   G15.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//245
"   G16.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//246
"   G17.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//247
"G18.реяр сцнк нр", "    ",      0,    200,      0, M_FDCOM|M_RMAX(2),		//248
"   G19.пегепб   ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),		//249
"   G20.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//250
"   G21.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//251
"   G22.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//252
"   G23.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//253
"   G24.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//254
"   G25.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//255
"   G26.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//256
"   G27.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//257
"   G28.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),		//258
"   G29.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4), 		//259
//-------------------------------------------------------------------
"H0.яняр йюкхап  ", "    ",      0,      3,      0, M_HIDE,					//260
"H1.  пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//261
"H2.онкнф гюйп 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),		//262
"H3.онкнф гюйп 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),		//263
"H4.онкнф нрйп 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),		//264
"H5.онкнф гюйп 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),		//265
"    H6.оюпнкэ 1 ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//266
"    H7.оюпнкэ 2 ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//267
"   H8.юбюпхх йг ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//268
"H9.рнкэйн сонп  ", "    ", 	 0,      1,  	 0, M_HIDE|M_RMAX(1),		//269
"м10.явервхй жхйк", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),		//270
"  H11.пегепб    ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),		//271
"  H12.пегепб    ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),		//272
"H13.йнк-бн сдюп ", "    ",      0,     10,      0, M_HIDE|M_RMAX(1),		//273
"   H14.пегепб   ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),		//274
"  H15.пегепб    ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),		//275
"H16.рнй оепеундю", "%   ",      0,   3000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),		//276
"H17.лнл рнй 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//277
"H18.лнл рнй 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//278
"H19.лнл рнй 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//279
"H20.лнл рнй 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//280
"H21.лнл рнй 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//281
"H22.лнл рнй 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//282
"H23.лнл рнй 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//283
"H24.лнл рнй 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//284
"H25.лнл рнй 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//285
"H26.лнл рнй 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//286
"H27.лнл рнй 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//287
"H28.лнл рнй 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//288
"H29.лнл рнй 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//289
"H30.лнл рнй 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//290
"H31.лнл рнй 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//291
"H32.лнл рнй 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//292
"H33.лнл рнй 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//293
"H34.лнл рнй 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//294
"H35.лнл рнй 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//295
"H36.лнл рнй 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//296
"H37.лнл сцнк 0_0", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//297
"H38.лнл сцнк 0_1", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//298
"H39.лнл сцнк 0_2", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//299
"H40.лнл сцнк 0_3", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//300
"H41.лнл сцнк 0_4", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//301
"H42.лнл сцнк 1_0", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//302
"H43.лнл сцнк 1_1", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//303
"H44.лнл сцнк 1_2", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//304
"H45.лнл сцнк 1_3", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//305
"H46.лнл сцнк 1_4", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//306
"H47.лнл сцнк 2_0", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//307
"H48.лнл сцнк 2_1", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//308
"H49.лнл сцнк 2_2", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//309
"H50.лнл сцнк 2_3", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//310
"H51.лнл сцнк 2_4", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//311
"H52.лнл сцнк 3_0", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//312
"H53.лнл сцнк 3_1", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//313
"H54.лнл сцнк 3_2", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//314
"H55.лнл сцнк 3_3", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//315
"H56.лнл сцнк 3_4", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//316
"H57.сцк яхтс 0_0", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//317
"H58.сцк яхтс 0_1", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//318
"H59.сцк яхтс 0_2", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//319
"H60.сцк яхтс 0_3", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//320
"H61.сцк яхтс 0_4", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//321
"H62.сцк яхтс 1_0", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//322
"H63.сцк яхтс 1_1", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//323
"H64.сцк яхтс 1_2", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//324
"H65.сцк яхтс 1_3", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//325
"H66.сцк яхтс 1_4", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//326
"H67.сцк яхтс 2_0", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//327
"H68.сцк яхтс 2_1", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//328
"H69.сцк яхтс 2_2", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//329
"H70.сцк яхтс 2_3", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//330
"H71.сцк яхтс 2_4", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//331
"H72.сцк яхтс 3_0", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//332
"H73.сцк яхтс 3_1", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//333
"H74.сцк яхтс 3_2", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//334
"H75.сцк яхтс 3_3", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//335
"H76.сцк яхтс 3_4", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),		//336
"H77.бп бша гюгнп", "C   ",      0,    100,      0, M_HIDE|M_RMAX(2)|M_PREC(1),		//337
"H78.дхюцм яерх  ", "    ",      0,  65530,      0, M_HIDE|M_SADR(35),		//338
"     H79.пегепб ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//339
"     H80.пегепб ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//340
"     H81.пегепб ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//341
"H82.япедм мюоп  ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),		//342
"H83.меаюк яерх  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),		//343
"H84.вепед яерх  ", "    ",      0,      2,      0, M_HIDE|M_SADR(182),		//344
"H85.мехяоп яерх ", "    ",      0,  65530,      0, M_HIDE|M_SADR(35),		//345
"     H86.пегепб ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//346
"H87.дхюцм мюцп  ", "    ",      0,  65530,      0, M_HIDE|M_SADR(52),		//347
"     H88.ADC_IU ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//348
"     H89.ADC_IV ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//349
"     H90.ADC_IW ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//350
" H91.япедмхи рнй", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),		//351
"H92.меа рнй мюцп", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),		//352
"  H93.онкнфемхе ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//353
"H94.яняр бунднб ", "    ",      0,  65530,      0, M_HIDE|M_SADR(86),		//354
"H95.яняр бшунднб", "    ",      0,  65530,      0, M_HIDE|M_SADR(103),		//355
"H96.рхо пебепяю ", "    ",      0,      2,      2, M_HIDE|M_SADR(185),		//356
"H97.пекеим пефхл", "    ",      0,      1,      0, M_HIDE|M_SADR(188),		//357
" H98.йнп рнйю U ", "    ",      0,  65530,   3800, M_FACT|M_RMAX(4),		//358
" H99.йнп рнйю V ", "    ",      0,  65530,   3800, M_FACT|M_RMAX(4),		//359
"H100.йнп рнйю W ", "    ",      0,  65530,   3800, M_FACT|M_RMAX(4),		//360
"H101.ялеы рнйю U", "    ",      0,  65530,  33000, M_FACT|M_RMAX(4),		//361
"H102.ялеы рнйю V", "    ",      0,  65530,  33000, M_FACT|M_RMAX(4),		//362
"H103.ялеы рнйю W", "    ",      0,  65530,  33000, M_FACT|M_RMAX(4),		//363
" H104.йнп мюоп R", "    ",      0,  65530,    160, M_FACT|M_RMAX(4),		//364
" H105.йнп мюоп S", "    ",      0,  65530,    160, M_FACT|M_RMAX(4),		//365
" H106.йнп мюоп T", "    ",      0,  65530,    160, M_FACT|M_RMAX(4),		//366
"H107.ялеы мюоп R", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),		//367
"H108.ялеы мюоп S", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),		//368
"H109.ялеы мюоп T", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4), 		//369
"H110.йнппейр жюо", "    ",      0,  65530,   4100, M_FACT|M_RMAX(4),		//370
"H111.ялеы жюо   ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),		//371
"  H112.пегепб   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//372
"H113.дхюцм сярп ", "    ",      0,  65530,      0, M_HIDE|M_SADR(69),		//373
"H114.хмдхй ярюп ", "    ",      0,     29,     18, M_HIDE|M_SADR(192),		//374
"H115.дефспм пеф ", "C   ",      0,   6000,      0, M_HIDE|M_RMAX(3),		//375
"H116.опнж хяонкм", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),		//376
"H117.мюв юдп яна", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//377
"H118.мюв юдп йнл", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//378
"H119.мюв юдп оюп", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//379
"H120.гюохях яна ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//380
"H121.гюохях йнл ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//381
"H122.гюохях оюп ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//382
"    H123.лнлемр ", "м*л ",      0,  11000,      0, M_HIDE|M_RMAX(4),		//383
"  H124.яйнпнярэ ", "на/л", -3600U,   3600,      0, M_HIDE|M_SIGN|M_RMAX(3),//384
"  H125.яейсмдш  ", "    ",      0,  	60,      0, M_HIDE|M_RMAX(1),		//385
"H126.соп йнмр   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//386
"H127.йнлюмдш асп", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//387
"H128.яапня фспм ", "    ",      0,  1,          0, M_HIDE|M_RMAX(4),		//388
" H129.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//389
" H130.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//390
" H131.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//391
" H132.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//392
" H133.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//393
" H134.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//394
" H135.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//395
" H136.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//396
" H137.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//397
" H138.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//398
" H139.пегепб    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),		//399
//-------------------------------------------------------------------
"ю0.ярюрся пюанрш", "    ",		0,	65530,		0, M_RUNS|M_SADR(1),		//400
"ю1.дхюц опнжеяяю", "    ",		0,	65530,		0, M_RUNS|M_SADR(18),		//401
"ю2.дхюцмняр яерх", "    ",		0,	65530,		0, M_RUNS|M_SADR(35),		//402
"ю3.дхюц мюцпсгйх", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(52),		//403
"ю4.дхюцм сярп-бю", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(69),		//404
#if BUR_M
"ю5.пегепб       ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),		//405
#else
" ю5.яняр бунднб ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(86),		//405
#endif
" ю6.яняр бшунднб", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(103),		//406
"  ю7.онкнфемхе  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 		//407
"   ю8.лнлемр    ", "м*л ", 	0,  11000,  	0, M_SHOW|M_RMAX(4),		//408
"   ю9.яйнпнярэ  ", "на/л",-3600U,   3600,  	0, M_SHOW|M_SIGN|M_RMAX(3),	//409
"ю10.мюоп тюгш R ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),		//410
"ю11.мюоп тюгш S ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),		//411
"ю12.мюоп тюгш T ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),		//412
" ю13.рнй тюгш U ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),//413
" ю14.рнй тюгш V ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),//414
" ю15.рнй тюгш W ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),//415
"ю16.сцнк мюцпсг ", "цпюд", -180U,    180,  	0, M_SHOW|M_SIGN|M_RMAX(2),		//416
"ю17.ярюрся йюкха", "    ", 	0,      3,  	0, M_STAT|M_SADR(120),			//417
"A18.онкнфемхе % ", "%   ",-1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),//418
" ю19.онкмши унд ", "на  ",     0,   3000,      0, M_SHOW|M_RMAX(3)|M_PREC(1),		 //419
"ю20.рейсыхи унд ", "на  ",-3000U,   3000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),//420
"ю21.явер жхйкнб ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),		//421
"ю22.релоепюрспю ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),	//422
"ю23.бепяхъ он   ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(3),	//423
"ю24.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//424
"ю25.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//425
"ю26.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//426
"ю27.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//427
"ю28.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//428
"ю29.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//429
"ю30.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//430
"ю31.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//431
"ю32.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//432
"ю33.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//433
"ю34.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//434
"ю35.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//435
"ю36.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//436
"ю37.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//437
"ю38.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),		//438
"ю39.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4), 		//439
//------------------------------------------------------------------- 
"     бпелъ      ", "    ",      0,  65535,      0, M_TIME|M_RONLY,			//
"      дюрю      ", "    ",      0,  65535,     33, M_DATE|M_RONLY,			//
"E0.ярюрся пюанрш", "    ",      0,  65535,      0, M_RUNS|M_SADR(1),		//
"E1.дхюцм опнжеяя", "    ",      0,  65535,      0, M_RUNS|M_SADR(18),		//
"E2.дхюцмняр яерх", "    ",      0,  65535,      0, M_RUNS|M_SADR(35),		//
"E3.дхюцм мюцпсгй", "    ",      0,  65535,      0, M_RUNS|M_SADR(52),		//
"E4.дхюцм сярп-бю", "    ",      0,  65530,      0, M_RUNS|M_SADR(69),		//
"E5.онкнфемхе %  ", "%   ", -1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//
"    E6.лнлемр   ", "м*л ",     10,  11000,     10, M_SHOW|M_RMAX(4),		//
"E7.мюопъф тюгш R", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),		//
"E8.мюопъф тюгш S", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),		//
"E9.мюопъф тюгш T", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),		//
"E10.рнй тюгш U  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),		//
"E11.рнй тюгш V  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),		//
"E12.рнй тюгш W  ", "ю/% ",  	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),		//
"E13.релоеп акнй ", "цпюд",   -100U,    100,     0, M_SHOW|M_SIGN|M_RMAX(2),		//
"E14.яняр бунднб ", "    ",      0,  65535,      0, M_RUNS|M_SADR(86),		//
"E15.яняр бшунднб", "    ",      0,  65535,      0, M_RUNS|M_SADR(103),		//
"   E16.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E17.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E18.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E19.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E20.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E21.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E22.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E23.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E24.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E25.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E26.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E27.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E28.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),		//
"   E29.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4)		//
};


const struct MENU_STRING values[] = {  
	"    гюохяэ      ",	// 0
//----------------
	"  ме нопедекем  ",	// 1
	"      ярно      ",	// 2
	"     юбюпхъ     ",	// 3
	" хдер гюйпшрхе  ",	// 4
	" хдер нрйпшрхе  ",	// 5
	"   хдер реяр    ",	// 6
	"    гюйпшрн     ",	// 7
	"    нрйпшрн     ",	// 8
	"     лстрю      ",	// 9
	" леярмне сопюбк ",	// 10
	"  бйкчвем рем   ",	// 11
#if BUR_M
	"    охрюмхе     ",	// 12
#else
	" яепбхя охрюмхе ",	// 12
#endif
	"юбюпхъ мю акнйе ",	// 13
	"  юбюпхъ мю ря  ",	// 14
	"  мехяопюбмнярэ ",	// 15
	"мехяопюбм мю акй",	// 16
	"мехяопюбм мю ря ",	// 17 
//--------------------------
	"   мер юбюпхи   ",	// 18
	"  мер дбхфемхъ  ",	// 19
	"  веп тюг дбхц  ",	// 20
	" ме гюдюмн гюйп ",	// 21
	" ме гюдюмн нрйп ",	// 22
	" мер йюкхапнбйх ",	// 23
	"сокнрм ме днярхц",	// 24
	"  оепецпеб дбхц ",	// 25
	"  мехяоп лс/дс  ",	// 26
	"     пегепб     ",	// 27
	"пефхл реу.опнцнм",	// 28
	"     пегепб     ",	// 29
	"     пегепб     ",	// 30
	"     пегепб     ",	// 31
	"     пегепб     ",	// 32
	"     пегепб     ",	// 33
	"     пегепб     ",	// 34
//--------------------------
	"   мер юбюпхи   ",	// 35
	"лхм мюоп тюгш R ",	// 36
	"лхм мюоп тюгш S ",	// 37
	"лхм мюоп тюгш T ",	// 38
	"люйя мюоп тюгш R",	// 39
	"люйя мюоп тюгш S",	// 40
	"люйя мюоп тюгш T",	// 41
	"меноп вепед тюг ",	// 42
	"меаюкюмя/напшб U",	// 43
	"слем мюоп тюгш R",	// 44
	"слем мюоп тюгш S",	// 45
	"слем мюоп тюгш T",	// 46
	"мюоп тюгш R 47% ",	// 47
	"мюоп тюгш S 47% ",	// 48
	"мюоп тюгш T 47% ",	// 49
	"  веп тюг яерх  ",	// 50
	"     пегепб     ",	// 51
//--------------------------
	"   мер юбюпхи   ",	// 52
	"  напшб тюгш U  ",	// 53
	"  напшб тюгш V  ",	// 54
	"  напшб тюгш W  ",	// 55
	"бп-рнй оепецпсгй",	// 56
	"     пегепб     ",	// 57
	"   йг тюгш U    ",	// 58
	"   йг тюгш V    ",	// 59
	"   йг тюгш W    ",	// 60
	"     пегепб     ",	// 61
	"     пегепб     ",	// 62
	" лхмхлюкэм рнй  ",	// 63
	" меаюкюмя рнйю  ",	// 64
	"     пегепб     ",	// 65
	"     пегепб     ",	// 66
	"     пегепб     ",	// 67
	"     пегепб     ",	// 68
	//---------------------------------------------------------------------------
	"   мер юбюпхи   ",	// 69
	"яани дюрв онкнф ",	// 70
	" яани оюлърх 1  ",	// 71
	" яани оюлърх 2  ",	// 72
	"   яани вюянб   ",	// 73
	"яани дюрв релоеп",	// 74
	" оепецпеб акнйю ",	// 75
	"оепенукюфд акнйю",	// 76
	"  яани ря/рс    ",	// 77
	#if BUR_M
	"     пегепб     ",	// 78
	#else
	"бшйкчвемхе акнйю",	// 78
	#endif
	"     пегепб     ",	// 79
	"     пегепб     ",	// 80
	"йпхр оепецпеб ак",	// 81
	"     пегепб     ",	// 82
	"     пегепб     ",	// 83
	"     пегепб     ",	// 84
	"     пегепб     ",	// 85
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 86
	"  бунд нрйпшрэ  ",	// 87
	"  бунд гюйпшрэ  ",	// 88
	"   бунд ярно    ",	// 89
	"    бунд лс     ",	// 90
	"    бунд дс     ",	// 91
	"     пегепб     ",	// 92
	"     пегепб     ",	// 93
	"     пегепб     ",	// 94
	"     пегепб     ",	// 95
	"     пегепб     ",	// 96
	"     пегепб     ",	// 97
	"     пегепб     ",	// 98
	"     пегепб     ",	// 99
	"     пегепб     ",	// 100
	"     пегепб     ",	// 101
	"     пегепб     ",	// 102
	//---------------------------------------------------------------------------
#if BUR_M
	"  мер яхцмюкнб  ",	// 103
	"    пегепб      ",	// 104
	"    пегепб      ",	// 105
	"     лстрю      ",	// 106
	"     юбюпхъ     ",	// 107
	"    пегепб      ",	// 108
	"     охрюмхе    ",	// 109
	"     гюйпшрн    ",	// 110
	"     нрйпшрн    ",	// 111
	" мехяопюбмнярэ  ",	// 112
	"     пегепб     ",	// 113
	"     пегепб     ",	// 114
	"     пегепб     ",	// 115
	"     пегепб     ",	// 116
	"     пегепб     ",	// 117
	"     пегепб     ",	// 118
	"     пегепб     ",	// 119
#else
	"  мер яхцмюкнб  ",	// 103
	"    юбюпхъ      ",	// 104
	"    гюйпшрн     ",	// 105
	"    нрйпшрн     ",	// 106
	"     лстрю      ",	// 107
	"  гюйпшбюеряъ   ",	// 108
	"  нрйпшбюеряъ   ",	// 109
	"     лс/дс      ",	// 110
	"  мехяопюбмнярэ ",	// 111
	"     пегепб     ",	// 112
	"     пегепб     ",	// 113
	"     пегепб     ",	// 114
	"     пегепб     ",	// 115
	"     пегепб     ",	// 116
	"     пегепб     ",	// 117
	"     пегепб     ",	// 118
	"     пегепб     ",	// 119
#endif
	//---------------------------------------------------------------------------
	" мер йюкхапнбйх ",	// 120
	" гюдюмн гюйпшрн ",	// 121
	" гюдюмн нрйпшрн ",	// 122
	"йюкхап бшонкмемю",	// 123
	//---------------------------------------------------------------------------
	"    йкхмнбюъ    ",	// 124
	"    ьхаепмюъ    ",	// 125
	//---------------------------------------------------------------------------
	"  ме нопедекем  ",	// 126
	" аег сокнрмемхъ ",	// 127
	"сокнрмемхе гюйп ",	// 128
	"сокнрмемхе нрйп ",	// 129
	"сок гюйп х нрйп ",	// 130
	//---------------------------------------------------------------------------
	"   мнплюкэмши   ",	// 131
	"    напюрмши    ",	// 132
	//---------------------------------------------------------------------------
	"деиярб гмювемхъ ",	// 133
	"опнжемрш нр мнл ",	// 134
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 135
	"  бшанп пефхлю  ",	// 136
	"    пефхл лс    ",	// 137
	"    пефхл дс    ",	// 138
	//---------------------------------------------------------------------------
	" бяе хмрептеияш ",	// 139
	"рнкэйн дхяйперм ",	// 140
	"рнкэйн онякеднб ",	// 141
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 142
	"    бйкчвемю    ",	// 143
	//---------------------------------------------------------------------------
	"      24б       ",	// 144
	"      220б      ",	// 145
	//---------------------------------------------------------------------------
	"    2400 анд    ",	// 146
	"    4800 анд    ",	// 147
	"    9600 анд    ",	// 147
	"   19200 анд    ",	// 149
	"   38400 анд    ",	// 150
	"   57600 анд    ",	// 151
	"   115200 анд   ",	// 152
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 153
	" хмдхй мю акнйе ",	// 154
	"хмд мю акнйе/ря ",	// 155
	"хмдхй х нярюмнб ",	// 156
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 157
	"     гюдюрэ     ",	// 158
	"    яапняхрэ    ",	// 159
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 160
	"    яапняхрэ    ",	// 161
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 162
	"      ярно      ",	// 163
	"    гюйпшрэ     ",	// 164
	"    нрйпшрэ     ",	// 165
	"  гюйпшрэ реяр  ",	// 166
	"  нрйпшрэ реяр  ",	// 167
	"     пегепб     ",	// 168
	"     пегепб     ",	// 169
	"     пегепб     ",	// 170
	"     пегепб     ",	// 171
	"     пегепб     ",	// 172
	"     пегепб     ",	// 173
	"     пегепб     ",	// 174
	"     пегепб     ",	// 175
	"     пегепб     ",	// 176
	"     пегепб     ",	// 177
	"     пегепб     ",	// 178
	"     пегепб     ",	// 179
	"     пегепб     ",	// 180
	"     пегепб     ",	// 181
	//---------------------------------------------------------------------------
	" ме нопедекемн  ",	// 182
	"напюрм онякеднб ",	// 183
	"опълюъ онякеднб ",	// 184
	//---------------------------------------------------------------------------
	"    нярюмнб     ",	// 185
	" юбрнлюрхвеяйхи ",	// 186
	"  хцмнпхпнбюмхе ", // 187
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 188
	"    бйкчвем     ",	// 189
	//---------------------------------------------------------------------------
	"мнпл пюгнлймсрши",	// 190
	" мнпл гюлймсрши ",	// 191
	//---------------------------------------------------------------------------
	" ярюрся пюанрш  ",	// 192
	" дхюцм опнжеяяю ",	// 193
	" дхюцмняр яерх  ",	// 194
	" дхюцм мюцпсгйх ",	// 195
	" дхюцм сярп-бю  ",	// 196
	"  яняр бунднб   ",	// 197
	"  яняр бшунднб  ",	// 198
	"     пегепб     ",	// 199
	"     лнлемр     ",	// 200
	"    яйнпнярэ    ",	// 201
	"  япедмее мюоп  ",	// 202
	"  япедмхи рнй   ",	// 203
	" сцнк мюцпсгйх  ",	// 204
	"     пегепб     ",	// 205
	"     пегепб     ",	// 206
	"     пегепб     ",	// 207
	"     пегепб     ",	// 208
	"     пегепб     ",	// 209
	"     пегепб     ",	// 210
	"     пегепб     ",	// 211
	"     пегепб     ",	// 212
	"     пегепб     ",	// 213
	"     пегепб     ",	// 214
	"     пегепб     ",	// 215
	"     пегепб     ",	// 216
	"     пегепб     ",	// 217
	"     пегепб     ",	// 218
	"     пегепб     ",	// 219
	"     пегепб     ",	// 220	
	"     пегепб     ",	// 221
	//----------------------------------------------
	"  он сярюбйюл   ",	// 222
	"он сяр я гюдепфй",	// 223
	" бяецдю бйк     ",	// 224
	" псвмне соп     ",	// 225
	//-----------------------------------------------
	"  аег опнбепйх  ",	// 226
	" мю мевермнярэ  ",	// 227
	"  мю вермнярэ   ",	// 228
   //-----------------------------------------------
    "ме нопедекем    ",	// 229
	"щож-100 ю.25    ",	// 230
	"щож-100 ю.50    ",	// 231
	"щож-400 а.20    ",	// 232
	"щож-400 а.50    ",	// 233
	"щож-800 б.40    ",	// 234
	"щож-1000 б.20   ",	// 235
	"щож-4000 ц.9    ",	// 236
	"щож-4000 ц.18   ",	// 237
	"щож-10000 д.6   ",	// 238
	"щож-10000 д.12  ",	// 239
  //---------------------------------------------------
	"  OLED WINSTAR  ",	// 240
	"   VAC FUTABA   ",	// 241
	//---------------------------------------------------------------------------
	"рнплнфем. ярюпне",	// 242
	"рнплнфемхе мнбне",	// 243 
  //---------------------------------------------------
	" осяй гюопеыем  ", // 244
	" осяй пюгпеьем  ", // 245
};

const struct MENU_STRING AddStr[] = {
	"сярпниярб гюмърн",	// 0
	"    йнлюмдю     ",	// 1
	"    нрлемемю    ",	// 2
	"  о 999.99%     ",	// 3
	//-----------------------------------------------
	"щйяо. мюярпнийю?",	// 4	0
	"    дю  мер     ",	// 5
	" гюдюрэ лнлемр  ",	// 6	1
	"йюкхапнбйх  нй  ",	// 7
	" рхо йюкхапнбйх ",	// 8	2
	" псвм  йнк.нанп ",	// 9	
	"оепебедх б онкнф",	// 10	3
	" гюйпшрн   нй   ",	// 11
	"оепебедх б онкнф",	// 12	4
	" нрйпшрн   нй   ",	// 13	
	"оепебедх б йпюим",	// 14	5
	"онкнфемхе   нй  ",	// 15
	"   онкнфемхе    ",	// 16	6
	"   гюйп  нрйп   ",	// 17
	"опнбепхрэ йюкха?",	// 18	7
	"    дю  мер     ", // 19
	"   осярхре б    ",	// 20	8
	"    нрйпшрн     ", // 21
	"   онкнфемхе    ",	// 22	9	// гДЕЯЭ БШБНДЪРЯЪ РЕЙСЫХЕ НАНПНРШ
	"                ", // 23
	"яапня йюкхапнб? ",	// 24	10
	"    дю  мер     ", // 25
	"   осярхре б    ",	// 26	11
	"    гюйпшрн     ", // 27
	" сярпюхб йюкха? ",	// 28	12
	"    дю  мер     ", // 29
	"гюдюире пюанвхе ",	// 30	13
	"  лнлемрш   нй  ", // 31
};


// ТХЙЯХПНБЮММШЕ РНВЙХ ДКЪ ЯМЪРХЪ ЛНЛЕМРЮ
Int VoltArray[CUB_COUNT1] = {160, 190,  220,  250};
Int CurrArray[CUB_COUNT2] = {400, 800, 1200, 1600, 2000};
Int AnUIArray[CUB_COUNT2] = { 25,  35,   50,   65,   80};
Int TorqArray[CUB_COUNT2] = { 25,  30,   50,   75,  100};

#if !TORQ_TEST
TCubConfig TqCurr  = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Imidpr, CurrArray};
TCubConfig TqAngUI = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Ram.GroupA.AngleUI, AnUIArray};
TCubConfig TqAngSf = {(Int *)&Ram.GroupH.Umid, VoltArray, (Int *)&Dmc.TorqueSetPr, TorqArray};
#else
TCubConfig TqCurr  = {(Int *)&TqUmid, VoltArray, (Int *)&TqImidPr,        CurrArray};
TCubConfig TqAngUI = {(Int *)&TqUmid, VoltArray, (Int *)&TqAnUI,          AnUIArray};
TCubConfig TqAngSf = {(Int *)&TqUmid, VoltArray, (Int *)&Dmc.TorqueSetPr, TorqArray};
#endif



char Icons[NUM_ICONS][7] =	{
				0x1F,0x11,0x1F,0x04,0x06,0x04,0x07,
				0x1F,0x11,0x11,0x1F,0x04,0x1F,0x00,
				0x06,0x15,0x0D,0x06,0x0D,0x015,0x06,
				};


#endif	//CREATE_STRUCTS


// лЮЙПНЯ ВРЕМХЪ ЯРПНЙХ ХГ ТКЕЬ. лЮЯЯХБ add_strings
#define ReadAddStr(Str, Index) \
	PFUNC_blkRead((int16*)&AddStr[Index], (int16*)Str, 16)

// лЮЙПНЯ ВРЕМХЪ ЯРПНЙХ ХГ ТКЕЬ. лЮЯЯХБ add_strings
#define ReadValuesStr(Str, Index) \
	PFUNC_blkRead((int16*)&values[Index], (int16*)Str, 16)

extern const struct MENU_GROUP  groups[];
extern const struct MENU_PARAM  params[];
extern const struct MENU_STRING values[];
extern const struct MENU_STRING AddStr[];
extern TCubConfig TqCurr;
extern TCubConfig TqAngUI;
extern TCubConfig TqAngSf;
extern char Icons[NUM_ICONS][7];

#endif
